bit-finance/Catalogs/бит_КомандыЗаполненияПроизвольныхПолейИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КомандыЗаполненияПроизвольныхПолейИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АссистентыИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыСистемы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСистемы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныПромптов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Промпт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныПромптовИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НастройкиДоступностиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиЭлементов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УбратьВидимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБлокироватьСостояниемДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЭлементовУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_КомандыЗаполненияПроизвольныхПолейИИ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеОбъектамиСистемыПриОткрытии();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбъектыСписоком Тогда
		СохранитьСписокОбъектов(ТекущийОбъект);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьСписокОбъектовСистемы(ТекущийОбъект.ОбъектыСистемы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;	
	ДанныеВыбора.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСписокОбъектовСистемы(Команда)
	
	ЗаполнитьСписокОбъектовСистемы(Объект.ОбъектыСистемы);
	
	Элементы.ОбъектСистемы.Видимость                = Ложь;
	Элементы.КомандаСписокОбъектовСистемы.Видимость = Ложь;
	Элементы.СписокОбъектов.Видимость               = Истина;
	
	ОбъектыСписоком = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДоступныеВидыОбъектов = Новый СписокЗначений;
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Документ"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Справочник"));
	ДоступныеВидыОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.Задача"));
	
	ОтборОбъектыСистемы = Новый СписокЗначений;	
	ОтборОбъектыСистемы.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокОбъектов",                СписокОбъектов);
	ПараметрыФормы.Вставить("ДоступныеВидыОбъектов",         ДоступныеВидыОбъектов);
	ПараметрыФормы.Вставить("ОтборОбъектыСистемы",           ОтборОбъектыСистемы);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",            Истина);
	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.Форма.ВыборОбъектовСистемы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СписокОбъектовПриИзмененииНаСервере()
	
	СохранитьСписокОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПриИзменении(Элемент)
	
	СписокОбъектовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектСистемы = Неопределено;
	Если Объект.ОбъектыСистемы.Количество() > 0 Тогда
		ОбъектСистемы = Объект.ОбъектыСистемы[0].ОбъектСистемы;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	                             
	// Откроем форму выбора элемента управления.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСистемы",       ОбъектСистемы);
	ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", Объект.ПолеЗаполнения);
	
	ОткрытьФорму("РегистрСведений.бит_НастройкиДоступностиЭлементов.Форма.ВыборЭлементаУправления",
					ПараметрыФормы, Элемент);
	
КонецПроцедуры
				
&НаКлиенте
Процедура ПолеЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если НЕ ПустаяСтрока(ВыбранноеЗначение.ИмяРеквизита) Тогда
			Объект.ПолеЗаполнения = СтрШаблон("Объект.%1", ВыбранноеЗначение.ИмяРеквизита);
		Иначе
			Объект.ПолеЗаполнения = ВыбранноеЗначение.ИмяЭлемента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры				

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеОбъектамиСистемыПриОткрытии()
	
	КоличествоОбъектов = Объект.ОбъектыСистемы.Количество();
	Если КоличествоОбъектов = 0 Тогда
		Объект.ОбъектыСистемы.Добавить();
	КонецЕсли;
	
	ОбъектыСписоком = (КоличествоОбъектов > 1);
	
	Элементы.ОбъектСистемы.Видимость                = НЕ ОбъектыСписоком;
	Элементы.КомандаСписокОбъектовСистемы.Видимость = НЕ ОбъектыСписоком;
	Элементы.СписокОбъектов.Видимость               = ОбъектыСписоком;
	
	Элементы.ОбъектСистемы.СписокВыбора.ЗагрузитьЗначения(ДоступныеОбъектыСистемы());
	
	МассивОбъектов = Объект.ОбъектыСистемы.Выгрузить().ВыгрузитьКолонку("ОбъектСистемы");
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовСистемы(Знач ОбъектыСистемы);
	
	СписокОбъектов.Очистить();
	
	Для каждого СтрокаОбъекта Из ОбъектыСистемы Цикл
		ТекущийОбъектСистемы = СтрокаОбъекта.ОбъектСистемы;
		Если ЗначениеЗаполнено(ТекущийОбъектСистемы) Тогда
			СписокОбъектов.Добавить(ТекущийОбъектСистемы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныеОбъектыСистемы()
	
	ДоступныеОбъекты = Новый Массив;
	ДоступныеОбъекты.Добавить(
		Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Справочники.бит_ВнутренниеДокументы));
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		ДоступныеОбъекты.Добавить(
			Справочники.бит_ОбъектыСистемы.ОбъектСистемыПоОбъектуМетаданных(Метаданные.Документы["бит_ПроектДоговора"]));
	КонецЕсли;
		
	Возврат ДоступныеОбъекты;
	
КонецФункции

&НаСервере
Процедура СохранитьСписокОбъектов(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ОбъектыСистемы = Объект.ОбъектыСистемы;
	Иначе
		ОбъектыСистемы = ТекущийОбъект.ОбъектыСистемы;
	КонецЕсли;
		
	ОбъектыСистемы.Очистить();
	Для каждого ЭлементСписка Из СписокОбъектов Цикл
		СтрокаОбъекта = ОбъектыСистемы.Добавить();
		СтрокаОбъекта.ОбъектСистемы = ЭлементСписка.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
